'''
- 도형을 만들고
- 각 도형이 배치된곳에 False 표시
- 각 도형들이 가지는 값 더해보기
- 최대인거 출력하기
'''
import sys
input = sys.stdin.readline
# (y,x)
poly = [
    # ㅡ (2)
    [(0,0),(0,1),(0,2),(0,3)],
    [(0,0),(1,0),(2,0),(3,0)],

    # ㅁ (1)
    [(0,0),(0,1),(1,0),(1,1)],

# ㄴ (8)
    [(0,0),(1,0),(2,0),(2,1)],
    [(0,1),(1,1),(2,1),(2,0)],
    [(0,0),(0,1),(1,0),(2,0)],
    [(0,0),(0,1),(1,1),(2,1)],
    [(0,0),(0,1),(0,2),(1,0)],
    [(0,0),(0,1),(0,2),(1,2)],
    [(1,0),(1,1),(1,2),(0,0)], 
    [(1,0),(1,1),(1,2),(0,2)],

    # S / Z (4)
    [(0,0),(0,1),(1,1),(1,2)],
    [(0,1),(1,0),(1,1),(2,0)],
    [(0,1),(0,2),(1,0),(1,1)],
    [(0,0),(1,0),(1,1),(2,1)],

    # ㅗ (4)
    [(0,0),(0,1),(0,2),(1,1)],
    [(0,1),(1,0),(1,1),(2,1)],
    [(1,0),(1,1),(1,2),(0,1)],
    [(0,0),(1,0),(1,1),(2,0)]
]

N, M = map(int, input().split())
board = [(list(map(int,input().split()))) for _ in range(N)]

# 현재 도형이 뭔지, 현재 합
def dfs(i, x, y, cost):
    for j in poly[i]:
        nx = x + j[0]
        ny = y + j[1]

        # 구간 확인
        if not ((0<=nx<N) and (0<=ny<M)):
            return 0
        # 구간이다?
        else:
            cost += board[nx][ny]

    return cost

maxv = 0

# 5개의 도형 하나씩 확인하기
for i in range(19):
    # 해당 도형의 최대
    res = 0

    # 시작점 하나 찍고
    for x in range(N):
        for y in range(M):
            # 도형이 보드 안에 있는지 확인
            if ((0<=x<N) and (0<=y<M)):
                # 격자안에 있는거 모두 더해
                val = dfs(i,x,y,0)
                res = max(res,val)

    # 가장 큰거 리턴
    maxv = max(maxv,res)

# 큰값중에 가장 큰 값
print(maxv)